///////////////////////////////////////////////////////////////////////////////////////////////////////
// (с) Tolkachev Pavel, 2021-2022
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//    http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

// Структура, содержащая параметры сервиса уведомлений. Подробнее см. описание функции
// pns4ones_СервисУведомленийВызовСервера.ПолучитьПараметрыСервисаУведомлений
Перем глПараметрыСервисаУведомлений Экспорт;

#КонецОбласти

#Область ОбработчикиСобытий

&После("ПередНачаломРаботыСистемы")
Процедура pns4ones_ПередНачаломРаботыСистемы(Отказ)
	
	pns4ones_СервисУведомленийКлиент.УстановитьПараметрыСервисаУведомлений();
	
КонецПроцедуры

&После("ПриНачалеРаботыСистемы")
Процедура pns4ones_ПриНачалеРаботыСистемы()
	
	Если глПараметрыСервисаУведомлений.Используется Тогда
		pns4ones_СервисУведомленийКлиент.НачатьПодключениеКомпоненты();
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаВнешнегоСобытия")
Процедура pns4ones_ОбработкаВнешнегоСобытия(Источник, Событие, Данные)

	ЭтоСообщениеСервисаУведомлений = (НРег(Источник) = "com_ptolkachev_pns4ones" И НРег(Событие) = "message");
	Если ЭтоСообщениеСервисаУведомлений Тогда
		pns4ones_СервисУведомленийКлиент.ОбработатьСообщение(Данные);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Инициализация

глПараметрыСервисаУведомлений = Новый Структура;

#КонецОбласти