///////////////////////////////////////////////////////////////////////////////////////////////////////
// (с) Tolkachev Pavel, 2021-2022
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//    http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает адрес и номер порта сервера выполняющего отправку уведомлений клиентским сеансам 1С.
// Подобнее см. описание функции pns4ones_СервисУведомлений.НастройкиСервераОтправкиУведомлений
//
Функция НастройкиСервераОтправкиУведомлений() Экспорт
	
	Возврат pns4ones_СервисУведомленийВызовСервера.НастройкиСервераОтправкиУведомлений();
	
КонецФункции

// Возвращает идентификатор текущей информационной базы. Подробнее см. описание функции
// pns4ones_СервисУведомленийПереопределяемый.ИдентификаторИнформационнойБазы
//
Функция ИдентификаторИнформационнойБазы() Экспорт
	
	Возврат pns4ones_СервисУведомленийВызовСервера.ИдентификаторИнформационнойБазы();
	
КонецФункции

// Возвращает настройки сервиса уведомлений. Подробнее см. описание функции
// pns4ones_СервисУведомлений.НастройкиСервисаУведомлений
//
Функция НастройкиСервисаУведомлений() Экспорт
	
	Возврат pns4ones_СервисУведомленийВызовСервера.НастройкиСервисаУведомлений();
	
КонецФункции

#КонецОбласти
